<?php
session_start();
?>

<!DOCTYPE html>
<html>

<head>
  <link rel="stylesheet" type="text/css" href="main.css">
  <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/animate.css/4.1.1/animate.min.css"/>
  <script src="/js/jquery_3_5_1.js" integrity="sha256-9/aliU8dGd2tb6OSsuzixeV4y/faTqgFtohetphbbj0=" crossorigin="anonymous"></script>
  <script src="https://cdn.jsdelivr.net/npm/sweetalert2@10"></script>
</head>

<body id="body">
<div style="width:70vw; margin:auto; margin-top:10vh;">
<h1>Καλώς ήρθατε στο πείραμά μας.</h1>
<p>
Στο συγκεκριμένο πείραμα θα ακούσετε ορισμένα μουσικά αποσπάσματα και το μόνο που θα σας ζητηθεί είναι να επισημάνετε τα σημεία στα οποία θεωρείτε ότι ξεκινά μια μουσική ιδέα. 
</p>
<p>
Μουσική ιδέα, στη συγκεκριμένη μελέτη, ορίζεται ως μια οποιαδήποτε ολοκληρωμένη μουσική δομή/οντότητα. Αυτή μπορεί να είναι μικρή ή μεγάλη σε διάρκεια. Επίσης μπορεί να αφορά τη μελωδία, το ρυθμό ή οποιοδήποτε συστατικό της μουσικής εσείς θεωρείτε ότι δημιουργεί ένα ολοκληρωμένο σύνολο. Tέλος, μια μουσική ιδέα μπορεί να ακούγεται πολλές φορές μέσα στο ίδιο ηχητικό απόσπασμα ή και όχι. Από εσάς ζητείται να σημειώσετε όλες τις φορές ασχέτως εάν η μουσική ιδέα είναι καινούργια ή όχι.	
</p>
<p>
Σκοπός της πειραματικής διαδικασίας είναι να καταγραφεί τι ορίζετε εσείς οι ακροατές, ως μια μουσική ιδέα.
</p>

<h1>
Διαδικασία
</h1>

<p>
Θα ακούσετε τρία μουσικά παραδείγματα διάρκειας περίπου 2 λεπτών, σε τέσσερις επαναλήψεις.
</p>
<p>
Η αποστολή σας είναι να επισημαίνετε κάθε φορά που θα ακούτε μια μουσική ιδέα να ξεκινά. Για να το σηματοδοτήσετε αυτό μπορείτε να πιέζετε οποιοδήποτε κουμπί του πληκτρολογίου που σημειώνεται με πράσινο χρώμα. Κάθε φορά που θα πατάτε πλήκτρο θα βλέπετε την σελίδα να φωτίζεται.
</p>
<p>
Στην οθόνη του υπολογιστή θα εμφανίζεται το σύμβολο για να ξεκινήσει η μουσική (play button) καθώς και μια γραμμή χρόνου που θα σημειώνει το χρονικό σημείο όπου βρίσκεται η μουσική.
</p>
	
<p>
Κατά τη διάρκεια του πειράματος δεν μπορείτε να γυρίσετε σε προηγούμενη σελίδα ή να ανανεώσετε τη σελίδα γιατί κάτι τέτοιο θα ακύρωνε τη συμμετοχή σας. </p>
	<p>Στο τέλος της ακρόασης θα σας ζητηθεί να συμπληρώσετε ένα ερωτηματολόγιο.</p>
	<p>Ο χρόνος διεκπεραίωσης της μελέτης υπολογίζεται γύρω στα 30 λεπτά.</p>


<p>
Για να εξοικειωθείτε με τη διαδικασία, στην επόμενη σελίδα υπάρχει ένα ηχητικό παράδειγμα με το οποίο μπορείτε να πειραματιστείτε. Σας ζητείται λοιπόν να πατήσετε οποιοδήποτε πλήκτρο, κάθε φορά που θεωρείτε πως μια μουσική ιδέα αρχίζει.
</p>
	
	<p>Προσοχή! Για να μπορέσετε να συμμετέχετε θα χρειαστείτε τον υπολογιστή σας (σταθερό ή φορητό). Επίσης τα κλικς σας σημειώνονται όσο παραμένετε στην καρτέλα του πειράματος.</p>	
	<p>Ευχαριστούμε για τη συμμετοχή!</p>
<div style="width:10vw; margin:auto; margin-top:10vh;">
<button style="margin:auto;" onclick="midiOrSample()">
  Συνέχεια
</button>
	
<script>
	


function midiOrSample()
{

$.ajax({
url     : 'includes/midiorsample.php',
method    : 'POST',
data :{
},
success   : function(response)
{
	//alert("data sent response is "+response)

if (response == "odd") {
window.location.replace("introm.php");
}

else if (response == "even") {
	window.location.replace("intro.php");
}
	
},
error : function(e)
{
alert("data not sent")
}
});
}
	
</script>
	
<div>
</div>

</body>

</htmal>
